{
    "intChecker": {
        "none": {
            "credit": [
                "Não me deste um número de créditos, baka!",
                "Créditos? Alô? Preciso de um número de créditos!"
            ],
            "craft": [
                "Não podes craftar nada, baka!"
            ],
            "default": [
                "Não incluiste um valor aqui, baka!",
                "**Sem valor, sem resultados** Disse o Bully!",
                "Um homem disse que tu tinhas um valor para a vida. Aparentemente, tu não consegues meter um pouco disse no comando."
            ]
        },
        "negative": {
            "credit": [
                "Não podes dar um número negativo de créditos!",
                "QUÉ QUE TÁS A FAZER?! A roubar créditos de alguém?! Detention for you! When will you learn?"
            ],
            "craft": [
                "Não podes craftar um número negativo, baka!",
                "Melhor venders-me nada do que craftares números negativos de items."
            ],
            "default": [
                "Não há números negativos neste comando, baka!",
                "Negativos? Aqui? AHAHAHAHAHA. És mesmo divertido!"
            ]
        },
        "zero": {
            "credit": [
                "Não podes usar zero créditos aqui! Aposta alguns *actuais* créditos e depois falamos.",
                "...wow, Não sabia que era tão obvio que eras pobre. Não apostate **N.A.D.A**, baka!"
            ],
            "craft": [
                "Porque é que tu tentas sequer craftar, baka!",
                "Diz-me a resposta a 0/0 e eu irei craftar-te 0 desse item."
            ],
            "default": [
                "Fomos divididos por 0. Não foi assim tão bom...",
                "O Zero é um número maligno. Não me dês esse para trabalhar."
            ]
        },
        "noInteger": {
            "credit": [
                "Não há cêntimos neste tipo de economia! Apenas créditos inteiros.",
                "Um crédito não se divide! Dá-me um número inteiro, baka!"
            ],
            "craft": [
                "Não podes craftar parte de uma coisa, baka!",
                "Uh... queres craftar metade de um item? És idiota ou quê?!"
            ],
            "default": [
                "Decimais? Isso é trabalho de frações. Não obrigado!",
                "Decimais: divertidos para olhar, mas impossíveis de usar para o que queres."
            ]
        }
    },
    "noRow": [
        "Não reclamaste os teus créditos diários! :cry:",
        "Ainda não te registaste e recebeste os teus primeiros créditos! D:",
        "Precisas de algum créditos, baka! Obtém alguns usando o comando diário!",
        "Créditos falam muitas coisas. Ouve alguns usando o comando diário!"
    ],
    "lessCredit": [
        "Não és assim tão rico, baka!",
        "Um pobre como tu nunca aguentaria uma aposta dessas.",
        "Tenta pagar em terra. É bem melhor do que a tua conta bancária neste momento.",
        "Tás a tentar dar-me a volta? Deu errado, baka!"
    ],
    "userSearch": {
        "balance": [
            "Bots não têm recordes!",
            "Bots não são autorizados a ter contas bancárias. Poderiam hackear as coisas fácilmtente desse modo.",
            "Tens sorte que eu não tenho uma dessas, porque senão eu já te mostrava o que a casa gasta!"
        ],
        "daily": [
            "Não podes dar os teus créditos a um bot, baka!",
            "Bots não têm contas bancárias para receberem diários!",
            "Qué que o bot vai fazer com tudo isso? É melhor não os dares nete momento."
        ],
        "rep": [
            "Não podes dar reputação. Porém, por quanto mais tu interagires comigo, Ficarei muito feliz :smile:",
            "Bots não podem ter reputação, baka!"
        ],
        "exchange": [
            "Não podes dar créditos a um bot user!",
            "Transferir para um bot user é impossível. Já tive ladrões suficientes."
        ],
        "award": [
            "Recompensado um player que não existe? Wow, Acho que algo deu eradoooooo.",
            "Os players falsos não são medalhados, baka!",
            "Outra vez a tentar recompensar players falsos?"
        ],
        "ecoedit": [
            "A tentar edtar os créditos numa conta falsa? Não na minha alçada, baka!",
            "Uma conta falsa é uma conta falsa. Fim da história"
        ],
        "default": [
            "Não sei o que estás a tentar encontrar, mas ou não existe ou escreveste mal.",
            "Onde está o player? Ele não tem GPS!",
            "Não encontrei nada! Dá-me algo melhor para pesquisar, baka!",
            "Outro player enexistente? A sério?",
            "... Não existe aqui um player, baka!",
            "Disseste player, Eu digo que não existe. Baka!"
        ]
    },
    "daily": {
        "self": [
            "Reclamaste 100 créditos!",
            "Poof! És 100 créditos mais rico agora!",
            "Não vás gastar os 100 créditos todos de uma vez agora.",
            "Reclamaste os teus créditos diários. Volta daqui a 24h para mais!",
            "Devias-me comprar um jogo com tant crédito. Não irei tirar-tos todos os 100, eu prometo."
        ],
        "other": [
            "Oh? Sentimo-nos generosos? Deste ao -user- -credit- créditos!",
            "Successo! O -user- é agoraw -credit- créditos mais rico!",
            "-user- vai mesmo fazer chover com etses -credit- extra créditos inos seus bolsos!"
        ],
        "noRow": [
            "Esse player ainda não reclamou o seu primeiro diário! :cry:",
            "Infelizmente, esse player não gosta dos meus jogos e ainda não reclamou o seu primeiro diário." 
        ],
        "badDaily": [
            "Nani?!?! Não podes dar créditos assim sem mais nem menos aqueles que ainda não reclamaram o seu primerio diário!,
            "Não reclamaste o teu primeiro diário!",
            "Não estás na minha lista. YDevias reclamar o teu primeiro diário para te registares."
        ],
        "multi": [
            "NÃO SPAMES O MEU COMANDO DIÁRIO!",
            "Já reclamaste o teu diário hoje, baka!",
            "Já reclamaste o teu diário por hoje.",
            "Não roubes! Já te paguei os teus créditos diários hoje, baka!"
        ]
    }
}
